# WEEKLY ASSIGNMENT 5

Ni Luh Gede Midya Frangginie

# define connection

In [2]:
import pandas as pd
import psycopg2

CONNECT_DB = "host=localhost port=5432 dbname=db_test user=db_test password=db_test"

# Load file CSV to database

## Table 1 banksim_bs140513_032310

### Create Table

In [30]:
#Create table for Dataset 1
create_table_query = '''CREATE TABLE bs140513_032310 (
    step smallint,
    customer varchar(20),
    age varchar(5),
    gender varchar(5),
    zipcodeOri varchar(20),
    merchant varchar(20),
    zipMerchant varchar(20),
    category varchar(30),
    amount float,
    fraud int
); '''

try:
    # Make connection to db
    connect1 = psycopg2.connect(CONNECT_DB)

    # Create a cursor to db
    cursor = connect1.cursor()
    
    # Send sql query to request
    cursor.execute(create_table_query)
    records = connect1.commit()

except (Exception, psycopg2.Error) as error :
    print ("Error while connecting to PostgreSQL", error)
    
finally:
    #closing database connection.
    if(connect1):
        cursor.close()
        connect1.close()
        print("PostgreSQL connection is closed")

print(f'Records:\n {records}')

PostgreSQL connection is closed
Records:
 None

### A ata to the table

In [31]:
try:
    # Make connection to db
    cxn = psycopg2.connect(CONNECT_DB)
    
    # Create a cursor to db
    cur = cxn.cursor()
    
    with open('./bs140513_032310.csv', 'r') as f:
        # skip first row, header row
        next(f)
        cur.copy_from(f, 'bs140513_032310', sep=",")
        cxn.commit()

except (Exception, psycopg2.Error) as error :
    print ("Error while connecting to PostgreSQL", error)
    
finally:
    #closing database connection.
    if(cxn):
        cur.close()
        cxn.close()
        print("PostgreSQL connection is closed")
        print("table populated")

PostgreSQL connection is closed
table populated

## Table 2 banksim_bsNET

In [32]:
create_table_query = '''CREATE TABLE bsNET140513_032310(
    Source varchar(20),
    Target varchar(20),
    Weight float,
    typeTrans varchar(50),
    fraud int
); '''

try:
    # Make connection to db
    connect1 = psycopg2.connect(CONNECT_DB)

    # Create a cursor to db
    cursor = connect1.cursor()
    
    # Send sql query to request
    cursor.execute(create_table_query)
    records = connect1.commit()

except (Exception, psycopg2.Error) as error :
    print ("Error while connecting to PostgreSQL", error)
    
finally:
    #closing database connection.
    if(connect1):
        cursor.close()
        connect1.close()
        print("PostgreSQL connection is closed")

print(f'Records:\n {records}')

PostgreSQL connection is closed
Records:
 None

In [38]:
#Create table for Dataset 1
try:
    # Make connection to db
    cxn = psycopg2.connect(CONNECT_DB)
    
    # Create a cursor to db
    cur = cxn.cursor()
    
    with open('./bsNET140513_032310.csv', 'r') as f:
        # skip first row, header row
        next(f)
        cur.copy_from(f, 'bsnet140513_032310', sep=",")
        cxn.commit()

except (Exception, psycopg2.Error) as error :
    print ("Error while connecting to PostgreSQL", error)
    
finally:
    #closing database connection.
    if(cxn):
        cur.close()
        cxn.close()
        print("PostgreSQL connection is closed")
        print("table populated")

PostgreSQL connection is closed
table populated

# Read data from postgresql

In [34]:
def pandas_db_server_fetch(sql_query):
    try:
        # Make connection to db
        cxn = psycopg2.connect(CONNECT_DB)

        # Send sql query to request and create dataframe
        df = pd.read_sql(sql_query, cxn)

    except (Exception, psycopg2.Error) as error :
        print ("Error while connecting to PostgreSQL", error)

    finally:
        #closing database connection.
        if(cxn):
            cxn.close()
            print("PostgreSQL connection is closed")
        return df

In [35]:
select_query = '''SELECT * FROM bs140513_032310;'''

df_1 = pandas_db_server_fetch(select_query)
df_1.head()

C:\Users\asus\AppData\Local\Temp\ipykernel_6828\2075102856.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql_query, cxn)

PostgreSQL connection is closed

,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud
0,0,'C1093826151','4','M','28007','M348934600','28007','es_transportation',4.55,0
1,0,'C352968107','2','M','28007','M348934600','28007','es_transportation',39.68,0
2,0,'C2054744914','4','F','28007','M1823072687','28007','es_transportation',26.89,0
3,0,'C1760612790','3','M','28007','M348934600','28007','es_transportation',17.25,0
4,0,'C757503768','5','M','28007','M348934600','28007','es_transportation',35.72,0

In [39]:
select_query = '''SELECT * FROM bsnet140513_032310;'''

df_2 = pandas_db_server_fetch(select_query)
df_2.head()

C:\Users\asus\AppData\Local\Temp\ipykernel_6828\2075102856.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql_query, cxn)

PostgreSQL connection is closed

          source         target  weight            typetrans  fraud
0  'C1093826151'   'M348934600'    4.55  'es_transportation'      0
1   'C352968107'   'M348934600'   39.68  'es_transportation'      0
2  'C2054744914'  'M1823072687'   26.89  'es_transportation'      0
3  'C1760612790'   'M348934600'   17.25  'es_transportation'      0
4   'C757503768'   'M348934600'   35.72  'es_transportation'      0

# Transformasi

## Tabel 1

In [40]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   step         594643 non-null  int64
 1   customer     594643 non-null  object
 2   age          594643 non-null  object
 3   gender       594643 non-null  object
 4   zipcodeori   594643 non-null  object
 5   merchant     594643 non-null  object
 6   zipmerchant  594643 non-null  object
 7   category     594643 non-null  object
 8   amount       594643 non-null  float64
 9   fraud        594643 non-null  int64
dtypes: float64(1), int64(2), object(7)
memory usage: 45.4+ MB

In [41]:
df_1.dtypes

step             int64
customer        object
age             object
gender          object
zipcodeori      object
merchant        object
zipmerchant     object
category        object
amount         float64
fraud            int64
dtype: object

In [42]:
df_1.describe()

                step         amount          fraud
count  594643.000000  594643.000000  594643.000000
mean       94.986827      37.890135       0.012108
std        51.053632     111.402831       0.109369
min         0.000000       0.000000       0.000000
25%        52.000000      13.740000       0.000000
50%        97.000000      26.900000       0.000000
75%       139.000000      42.540000       0.000000
max       179.000000    8329.960000       1.000000

In [43]:
df_1.describe(include="all")

,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud
count,594643.000000,594643,594643,594643,594643,594643,594643,594643,594643.000000,594643.000000
unique,NaN,4112,8,4,1,50,1,15,NaN,NaN
top,NaN,'C1978250683','2','F','28007','M1823072687','28007','es_transportation',NaN,NaN
freq,NaN,265,187310,324565,594643,299693,594643,505119,NaN,NaN
mean,94.986827,NaN,NaN,NaN,NaN,NaN,NaN,NaN,37.890135,0.012108
std,51.053632,NaN,NaN,NaN,NaN,NaN,NaN,NaN,111.402831,0.109369
min,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.000000,0.000000
25%,52.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.740000,0.000000
50%,97.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,26.900000,0.000000
75%,139.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,42.540000,0.000000
max,179.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8329.960000,1.000000

### Null Values

In [44]:
# counting null values 

missing_count_1 = df_1.isnull().sum()
missing_count_1

step           0
customer       0
age            0
gender         0
zipcodeori     0
merchant       0
zipmerchant    0
category       0
amount         0
fraud          0
dtype: int64

### removing quotes symbol

In [45]:
#removing quote from dataset

cols_with_quotes = ['customer', 'age','gender','zipcodeori','merchant','zipmerchant','category']
df_1[cols_with_quotes] = df_1[cols_with_quotes].applymap(lambda x: x.strip("' "))

df_1.head()

,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud
0,0,C1093826151,4,M,28007,M348934600,28007,es_transportation,4.55,0
1,0,C352968107,2,M,28007,M348934600,28007,es_transportation,39.68,0
2,0,C2054744914,4,F,28007,M1823072687,28007,es_transportation,26.89,0
3,0,C1760612790,3,M,28007,M348934600,28007,es_transportation,17.25,0
4,0,C757503768,5,M,28007,M348934600,28007,es_transportation,35.72,0

### analyzing types

In [47]:
df_1.describe(include="all")

,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud
count,594643.000000,594643,594643,594643,594643,594643,594643,594643,594643.000000,594643.000000
unique,NaN,4112,8,4,1,50,1,15,NaN,NaN
top,NaN,C1978250683,2,F,28007,M1823072687,28007,es_transportation,NaN,NaN
freq,NaN,265,187310,324565,594643,299693,594643,505119,NaN,NaN
mean,94.986827,NaN,NaN,NaN,NaN,NaN,NaN,NaN,37.890135,0.012108
std,51.053632,NaN,NaN,NaN,NaN,NaN,NaN,NaN,111.402831,0.109369
min,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0.000000,0.000000
25%,52.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,13.740000,0.000000
50%,97.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,26.900000,0.000000
75%,139.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,42.540000,0.000000
max,179.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,8329.960000,1.000000

In [49]:
df_1

,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud
0,0,C1093826151,4,M,28007,M348934600,28007,es_transportation,4.55,0
1,0,C352968107,2,M,28007,M348934600,28007,es_transportation,39.68,0
2,0,C2054744914,4,F,28007,M1823072687,28007,es_transportation,26.89,0
3,0,C1760612790,3,M,28007,M348934600,28007,es_transportation,17.25,0
4,0,C757503768,5,M,28007,M348934600,28007,es_transportation,35.72,0
...,...,...,...,...,...,...,...,...,...,...
594638,179,C1753498738,3,F,28007,M1823072687,28007,es_transportation,20.53,0
594639,179,C650108285,4,F,28007,M1823072687,28007,es_transportation,50.73,0
594640,179,C123623130,2,F,28007,M349281107,28007,es_fashion,22.44,0
594641,179,C1499363341,5,M,28007,M1823072687,28007,es_transportation,14.46,0
594642,179,C616528518,4,F,28007,M1823072687,28007,es_transportation,26.93,0

In [50]:
df_1.age.unique()

#there is value other than number

array(['4', '2', '3', '5', '1', '6', 'U', '0'], dtype=object)

In [52]:
df_1.gender.unique()

array(['M', 'F', 'E', 'U'], dtype=object)

In [53]:
df_1.zipcodeori.unique()

array(['28007'], dtype=object)

In [54]:
df_1.zipmerchant.unique()

array(['28007'], dtype=object)

### Exception for age

In [55]:
#adding exception, so if there is any data other than number, will be replaced with 0

df_1['age'] = df_1['age'].apply(lambda x: int(x) if x.isdigit() else 0)

### Invalid Gender

In [71]:
# Define invalid gender values
invalid_genders = ['E', 'U']

# Replace invalid gender values with 'Unknown'
df_1.loc[df_1['gender'].isin(invalid_genders), 'gender'] = 'unknown'

In [75]:
df_1.gender.unique()

array(['M', 'F', 'unknown'], dtype=object)

### Changing datatype

In [56]:
#changing datatype

df_1['age'] = df_1['age'].astype(int)
df_1['zipcodeori'] = df_1['zipcodeori'].astype(int)
df_1['zipmerchant'] = df_1['zipmerchant'].astype(int)

### Save to CSV

In [74]:
df_1.tail()

,step,customer,age,gender,zipcodeori,merchant,zipmerchant,category,amount,fraud
594638,179,C1753498738,3,F,28007,M1823072687,28007,es_transportation,20.53,0
594639,179,C650108285,4,F,28007,M1823072687,28007,es_transportation,50.73,0
594640,179,C123623130,2,F,28007,M349281107,28007,es_fashion,22.44,0
594641,179,C1499363341,5,M,28007,M1823072687,28007,es_transportation,14.46,0
594642,179,C616528518,4,F,28007,M1823072687,28007,es_transportation,26.93,0

In [76]:
df_2.to_csv("banksim_bs140513_032310.csv", index=False, header=False)

## Tabel 2

In [58]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 594643 entries, 0 to 594642
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   source     594643 non-null  object
 1   target     594643 non-null  object
 2   weight     594643 non-null  float64
 3   typetrans  594643 non-null  object
 4   fraud      594643 non-null  int64
dtypes: float64(1), int64(1), object(3)
memory usage: 22.7+ MB

In [59]:
df_2.dtypes

source        object
target        object
weight       float64
typetrans     object
fraud          int64
dtype: object

In [60]:
df_2.describe()

              weight          fraud
count  594643.000000  594643.000000
mean       37.890135       0.012108
std       111.402831       0.109369
min         0.000000       0.000000
25%        13.740000       0.000000
50%        26.900000       0.000000
75%        42.540000       0.000000
max      8329.960000       1.000000

In [61]:
df_2.describe(include="all")

,source,target,weight,typetrans,fraud
count,594643,594643,594643.000000,594643,594643.000000
unique,4112,50,NaN,15,NaN
top,'C1978250683','M1823072687',NaN,'es_transportation',NaN
freq,265,299693,NaN,505119,NaN
mean,NaN,NaN,37.890135,NaN,0.012108
std,NaN,NaN,111.402831,NaN,0.109369
min,NaN,NaN,0.000000,NaN,0.000000
25%,NaN,NaN,13.740000,NaN,0.000000
50%,NaN,NaN,26.900000,NaN,0.000000
75%,NaN,NaN,42.540000,NaN,0.000000
max,NaN,NaN,8329.960000,NaN,1.000000

### Null Values

In [62]:
# counting null values 

missing_count_2 = df_2.isnull().sum()
missing_count_2

source       0
target       0
weight       0
typetrans    0
fraud        0
dtype: int64

### Removing quote symbol

In [63]:
df_2

               source         target  weight            typetrans  fraud
0       'C1093826151'   'M348934600'    4.55  'es_transportation'      0
1        'C352968107'   'M348934600'   39.68  'es_transportation'      0
2       'C2054744914'  'M1823072687'   26.89  'es_transportation'      0
3       'C1760612790'   'M348934600'   17.25  'es_transportation'      0
4        'C757503768'   'M348934600'   35.72  'es_transportation'      0
...               ...            ...     ...                  ...    ...
594638  'C1753498738'  'M1823072687'   20.53  'es_transportation'      0
594639   'C650108285'  'M1823072687'   50.73  'es_transportation'      0
594640   'C123623130'   'M349281107'   22.44         'es_fashion'      0
594641  'C1499363341'  'M1823072687'   14.46  'es_transportation'      0
594642   'C616528518'  'M1823072687'   26.93  'es_transportation'      0

[594643 rows x 5 columns]

In [64]:
#removing quote from dataset

cols_with_quotes = ['source', 'target','typetrans']
df_2[cols_with_quotes] = df_2[cols_with_quotes].applymap(lambda x: x.strip("' "))

df_2.head()

        source       target  weight          typetrans  fraud
0  C1093826151   M348934600    4.55  es_transportation      0
1   C352968107   M348934600   39.68  es_transportation      0
2  C2054744914  M1823072687   26.89  es_transportation      0
3  C1760612790   M348934600   17.25  es_transportation      0
4   C757503768   M348934600   35.72  es_transportation      0

In [65]:
df_2

             source       target  weight          typetrans  fraud
0       C1093826151   M348934600    4.55  es_transportation      0
1        C352968107   M348934600   39.68  es_transportation      0
2       C2054744914  M1823072687   26.89  es_transportation      0
3       C1760612790   M348934600   17.25  es_transportation      0
4        C757503768   M348934600   35.72  es_transportation      0
...             ...          ...     ...                ...    ...
594638  C1753498738  M1823072687   20.53  es_transportation      0
594639   C650108285  M1823072687   50.73  es_transportation      0
594640   C123623130   M349281107   22.44         es_fashion      0
594641  C1499363341  M1823072687   14.46  es_transportation      0
594642   C616528518  M1823072687   26.93  es_transportation      0

[594643 rows x 5 columns]

In [66]:
df_2.source.unique()

array(['C1093826151', 'C352968107', 'C2054744914', ..., 'C1014783484',
       'C849065220', 'C1809646275'], dtype=object)

In [67]:
df_2.target.unique()

array(['M348934600', 'M1823072687', 'M50039827', 'M1888755466',
       'M1053599405', 'M85975013', 'M480139044', 'M692898500',
       'M348875670', 'M151143676', 'M840466850', 'M1741626453',
       'M1535107174', 'M855959430', 'M349281107', 'M209847108',
       'M2122776122', 'M1873032707', 'M2011752106', 'M857378720',
       'M1198415165', 'M1748431652', 'M980657600', 'M1352454843',
       'M117188757', 'M547558035', 'M17379832', 'M1649169323',
       'M1946091778', 'M97925176', 'M923029380', 'M1353266412',
       'M1842530320', 'M677738360', 'M1313686961', 'M732195782',
       'M1600850729', 'M1872033263', 'M3697346', 'M495352832',
       'M1400236507', 'M1294758098', 'M1913465890', 'M45060432',
       'M78078399', 'M2080407379', 'M1788569036', 'M1416436880',
       'M933210764', 'M1726401631'], dtype=object)

In [68]:
df_2.weight.unique()

array([  4.55,  39.68,  26.89, ..., 249.18, 224.81, 190.31])

In [69]:
df_2.typetrans.unique()

array(['es_transportation', 'es_health', 'es_otherservices', 'es_food',
       'es_hotelservices', 'es_barsandrestaurants', 'es_tech',
       'es_sportsandtoys', 'es_wellnessandbeauty', 'es_hyper',
       'es_fashion', 'es_home', 'es_contents', 'es_travel', 'es_leisure'],
      dtype=object)

### Save to CSV

In [77]:
df_2.to_csv("banksim_bsnet140513_032310.csv", index=False, header=False)

# Load ke CLoud Storage

In [78]:
from google.cloud import storage

In [79]:
client = storage.Client()

In [80]:
client.create_bucket("datafellowship_week5_bucket")

## Upload data 1

In [81]:
client = storage.Client()
bucket = client.bucket("datafellowship_week5_bucket")
blob = bucket.blob("datafellowship_week5_bucket/dataweekly5/banksim_bs140513_032310.csv")
source_file_name = "C:/kerja/iykra/week_5/banksim_bs140513_032310.csv"

In [82]:
def upload_blob(bucket, source_file_name, blob):
    """Uploads a file to the bucket."""
    # The ID of your GCS bucket
    # bucket_name = "your-bucket-name"
    # The path to your file to upload
    # source_file_name = "local/path/to/file"
    # The ID of your GCS object
    # destination_blob_name = "storage-object-name"

    bucket = bucket
    blob = blob
    source_file_name = source_file_name

    # Optional: set a generation-match precondition to avoid potential race conditions
    # and data corruptions. The request to upload is aborted if the object's
    # generation number does not match your precondition. For a destination
    # object that does not yet exist, set the if_generation_match precondition to 0.
    # If the destination object already exists in your bucket, set instead a
    # generation-match precondition using its generation number.
    generation_match_precondition = 0

    blob.upload_from_filename(source_file_name, if_generation_match=generation_match_precondition)

    print(
        f"File {source_file_name} uploaded to {blob}."
    )

In [83]:
upload_blob(bucket, source_file_name, blob)

File C:/kerja/iykra/week_5/banksim_bs140513_032310.csv uploaded to <Blob: datafellowship_week5_bucket, datafellowship_week5_bucket/dataweekly5/banksim_bs140513_032310.csv, 1715442620269184>.

### Upload data 2

In [84]:
client = storage.Client()
bucket = client.bucket("datafellowship_week5_bucket")
blob = bucket.blob("datafellowship_week5_bucket/dataweekly5/bsNET140513_032310.csv")
source_file_name = "C:/kerja/iykra/week_5/bsNET140513_032310.csv"

In [85]:
upload_blob(bucket, source_file_name, blob)

File C:/kerja/iykra/week_5/bsNET140513_032310.csv uploaded to <Blob: datafellowship_week5_bucket, datafellowship_week5_bucket/dataweekly5/bsNET140513_032310.csv, 1715442723090184>.

In [ ]:
def upload_many_blobs_with_transfer_manager(
    bucket_name, filenames, source_directory="", workers=8
):
    """Upload every file in a list to a bucket, concurrently in a process pool.

    Each blob name is derived from the filename, not including the
    `source_directory` parameter. For complete control of the blob name for each
    file (and other aspects of individual blob metadata), use
    transfer_manager.upload_many() instead.
    """

    # The ID of your GCS bucket
    # bucket_name = "your-bucket-name"

    # A list (or other iterable) of filenames to upload.
    # filenames = ["file_1.txt", "file_2.txt"]

    # The directory on your computer that is the root of all of the files in the
    # list of filenames. This string is prepended (with os.path.join()) to each
    # filename to get the full path to the file. Relative paths and absolute
    # paths are both accepted. This string is not included in the name of the
    # uploaded blob; it is only used to find the source files. An empty string
    # means "the current working directory". Note that this parameter allows
    # directory traversal (e.g. "/", "../") and is not intended for unsanitized
    # end user input.
    # source_directory=""

    # The maximum number of processes to use for the operation. The performance
    # impact of this value depends on the use case, but smaller files usually
    # benefit from a higher number of processes. Each additional process occupies
    # some CPU and memory resources until finished. Threads can be used instead
    # of processes by passing `worker_type=transfer_manager.THREAD`.
    # workers=8

    from google.cloud.storage import Client, transfer_manager

    storage_client = Client()
    bucket = storage_client.bucket(bucket_name)

    results = transfer_manager.upload_many_from_filenames(
        bucket, filenames, source_directory=source_directory, max_workers=workers
    )

    for name, result in zip(filenames, results):
        # The results list is either `None` or an exception for each filename in
        # the input list, in order.

        if isinstance(result, Exception):
            print("Failed to upload {} due to exception: {}".format(name, result))
        else:
            print("Uploaded {} to {}.".format(name, bucket.name))